Revit 2027 API
PDFExportQualityType Enumeration
 An enumerated type listing the options for PDF export quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PDFExportQualityType
Public Enumeration PDFExportQualityType
public enum class PDFExportQualityType
type PDFExportQualityType
Members
Member name | Value | Description
DPI1200 | 1,200
DPI144 | 144
DPI2400 | 2,400
DPI300 | 300
DPI3600 | 3,600
DPI4000 | 4,000
DPI600 | 600
DPI72 | 72
See Also
Reference
Autodesk.Revit.DB Namespace